In [1]:
import pandas as pd

In [2]:
grades = {
    "Student": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "math": [85, 62, 90, 45, 88],
    "science": [92, 70, 95, 55, 82],
    "english": [78, 85, 88, 60, 90]
}

In [3]:
df_grades= pd.DataFrame(grades)
df_grades

   Student  math  science  english
0    Alice    85       92       78
1      Bob    62       70       85
2  Charlie    90       95       88
3    David    45       55       60
4      Eve    88       82       90

In [8]:
df_grades["average"] =(df_grades["math"]+df_grades["science"]+df_grades["english"])/3

df_grades

   Student  math  science  english    average
0    Alice    85       92       78  85.000000
1      Bob    62       70       85  72.333333
2  Charlie    90       95       88  91.000000
3    David    45       55       60  53.333333
4      Eve    88       82       90  86.666667

In [19]:
failing_students =df_grades[df_grades["average"] < 70]
failing_students

  Student  math  science  english    average  failing_students
3   David    45       55       60  53.333333              True